# Dotfiles Brewfile
# This file manages Homebrew packages for the development environment
# Language toolchains (node, python, rust, go) are managed separately via volta, rustup, etc.

# ========================================
# Core Development Tools
# ========================================
brew "git"
brew "git-lfs"
brew "neovim"
brew "tmux"
brew "zsh"

# ========================================
# Shell Enhancements
# ========================================
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Fast grep alternative
brew "eza"          # Modern ls replacement
brew "bat"          # Cat with syntax highlighting
brew "zoxide"       # Smarter cd command

# ========================================
# Development Utilities
# ========================================
brew "gh"           # GitHub CLI
brew "jq"           # JSON processor
brew "wget"         # File downloader
brew "curl"         # URL transfer tool
brew "htop"         # Interactive process viewer

# ========================================
# Productivity Tools
# ========================================
brew "terminal-notifier"  # macOS notifications from terminal

# ========================================
# Fonts
# ========================================
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
